# <center><b>Week-3 Python Programming</b></center>
## <center><b>Learning Pandas</b></center>
## <u><center>Author: Ujjwal Karki</center></u>

## Introduction
This notebook consists of the work from our Python course's third week activities. This week, we studied about modules, packages, and libraries. While studying about libraries we jumped towards the well-known library of Python i.e., Pandas. Since it is a library, Pandas needs to be imported into our program to use its functionality. Pandas has its own data format which is called a DataFrame. Within this DataFrame, we can write down data as key value pairs where values can also be list, tuples, etc. This is corresponding to field and rows of a table and once we output this DataFrame, it is represented in a similar format of a table. We then learned to read and save csv, excel, and json files using Pandas. Then we moved onto data exploration with Pandas. Basically, we learned about three things here: shape, head, tail, info, and describe. To briefly say what they all do:
- shape: provides the numbers of rows and columns of the DataFrame
- head and tail: head provides the first 5 data by default and tail vice-versa.
- info: provides the number of rows and columns as well as the data type of the data and the memory space that DataFrame takes, etc.
- describe: It describes the basic calculations of the DataFrame like the mean, quartiles, and all.<br><br>
The last topic was data selection and indexing. There are four techniques that we learned about. Firstly, basic indexing. As the name suggests, while performing this indexing, we can simply pass down the name of the field in single or multiple using lists. Furthermore, we can perform rows slicing using range definition. However, one thing to consider here, while defining the rows the last row is also selected. So far we have studied that if we define a range say (0:3) then it means 0,1,2, but here it means 0,1,2, and 3. Next indexing technique is lable based indexing i.e., loc. In loc we can do the row slicing, however, we can also define the fields that we want. Furthermore, this definition of field can be set as 'to' or just some particular field. For e.x., we can say .loc[:2] asking for three rows. Meanwhile we can also add, .loc[:2, 'name':'mark']. This means to give us three rows for the fields from name to mark. However, we can be specific and say .loc[:2, ['name','mark']] which now implies just the columns name and mark. Second last indexing technique is integer-location based (iloc) which basically means that instead of writing down the name of the fields, we can simply provide their index which begins from 0 if you are curious. All the other things are same as loc. Lastly, we have single value access (.at or .iat) which is basically used if we want some specific row and specific column only.

### Python Module
- A module is a single python file (.py) containing definitions, functions, classes, variables

### Python Package
- Apackage is a collection of Python modules grouped together within a directory, allowing them to be managed as a unit
- Each package must contain an __init__(.py) file, which can be empty

### Python Library
- Grouping of modules and packages

### Pandas (Data Format)
- Series: Provide the data in a series form
- DataFrame: Provides the data in tabular form where it uses Python's dictionary's 'key' as fields and the values of key as values

In [1]:
import pandas as pd
#crate new series
num_series = pd.Series([1,2,3,4])

#print(num_series)

#create new Data Frame
user_data = pd.DataFrame({
    "Name" : ["Ram","Shyam"],
    "Age" : [23,20],
    "Address" : ["Kathmandu", "Lalitpur"] 
})

print(type(user_data))
print(user_data)

<class 'pandas.core.frame.DataFrame'>
    Name  Age    Address
0    Ram   23  Kathmandu
1  Shyam   20   Lalitpur

#### Rading from CSV File

In [6]:
import pandas as pd

# Read data from csv
student_csv_data = pd.read_csv('Data/student.csv') 
student_csv_data.head(10) # Displays the top 5 data from the csv file by default. We can print custom number of data by passing the number as argument
# student_csv_data.tail() # Same as head but for bottom 5 data

   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
8   9      Tes Qry    Six    78    male
9  10     Big John   Four    55  female

#### Reading from Excel file

In [11]:
# Read data from xlsx (Excel) file
student_excel_data = pd.read_excel('Data/student.xlsx')
student_excel_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

#### Reading from Json File

In [10]:
stu_json_data = pd.read_json('Data/studentj.json')
stu_json_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

### Saving the files

In [1]:
import pandas as pd

#create new Data Frame
user_data = pd.DataFrame({
    "Name" : ["Ram","Shyam"],
    "Age" : [23,20],
    "Address" : ["Kathmandu", "Lalitpur"] 
})

user_data.to_csv('Data/user_data.csv')
user_data.to_excel('Data/user_data.xlsx')
user_data.to_json('Data/user_data.json')

## Basic Data Exploration

### Data Inspection

In [5]:
import pandas as pd

students = pd.read_csv('Data/student.csv')
# print(students.shape)
# students.head()
# print(students.tail())
# print(students.info())
students.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

## Data Selection and Indexing in Pandas

- Basic Indexing
- Label-based Indexing (.loc[])
- Integer-Label-based Indexing (.iloc[])
- Single value access (.at[], .iat[])

#### Basic indexing

In [ ]:
print(students['id']) # Single column as a series
new_std_data = students[['id','name','mark']].copy()
print(new_std_data) # Multiple columns as a DataFrame

# Slicing rows
first_10_rows = students[:10].copy()
print(first_10_rows) # only first rows (dataframe)
last_five_rows = students[30:].copy()
print(last_five_rows) # rows from index 30 to last index (dataframe)

    id         name
0    1     John Deo
1    2     Max Ruin
2    3       Arnold
3    4   Krish Star
4    5    John Mike
5    6    Alex John
6    7  My John Rob
7    8       Asruid
8    9      Tes Qry
9   10     Big John
10  11       Ronald
11  12        Recky
12  13          Kty
13  14         Bigy
14  15     Tade Row
15  16        Gimmy
16  17        Tumyu
17  18        Honny
18  19        Tinny
19  20       Jackly
20  21   Babby John
21  22       Reggid
22  23        Herod
23  24    Tiddy Now
24  25     Giff Tow
25  26       Crelea
26  27     Big Nose
27  28    Rojj Base
28  29  Tess Played
29  30    Reppy Red
30  31  Marry Toeey
31  32    Binn Rott
32  33    Kenn Rein
33  34     Gain Toe
34  35   Rows Noump
    id         name  mark
0    1     John Deo    75
1    2     Max Ruin    85
2    3       Arnold    55
3    4   Krish Star    60
4    5    John Mike    60
5    6    Alex John    55
6    7  My John Rob    78
7    8       Asruid    85
8    9      Tes Qry    78
9   10     Big John    55
10  11       Ronald    89
11  12        Recky    94
12  13          Kty    88
13  14         Bigy    88
14  15     Tade Row    88
15  16        Gimmy    88
16  17        Tumyu    54
17  18        Honny    75
18  19        Tinny    18
19  20       Jackly    65
20  21   Babby John    69
21  22       Reggid    55
22  23        Herod    79
23  24    Tiddy Now    78
24  25     Giff Tow    88
25  26       Crelea    79
26  27     Big Nose    81
27  28    Rojj Base    86
28  29  Tess Played    55
29  30    Reppy Red    79
30  31  Marry Toeey    88
31  32    Binn Rott    90
32  33    Kenn Rein    96
33  34     Gain Toe    69
34  35   Rows Noump    88
   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
8   9      Tes Qry    Six    78    male
9  10     Big John   Four    55  female

### Label based index (.loc[])
- .loc is used for selecting rows and columns by label
- we can use single labels, list of labels, or slices of labels

In [1]:
# Selecting rows based on label. loc takes the last range as well so 0:2 is normally 0,1 but here it is 0,1,2
import pandas as pd
students = pd.read_csv('Data/student.csv')
first_row = students.loc[1]
first_two_rows = students.loc[:2]

print("Simple loc from here: ")
print(first_row)
print(first_two_rows)

# # Selecting specific rows to columns
# print('Selecting specific rows from here:')
# print()
# first_two_stds_with_name_to_marks = students.loc[0:2,'name':'mark'] # first 3 rows with column from name to mark including name and mark
# print(first_two_stds_with_name_to_marks)

# frist_and_second_row_with_name_and_gender = students.loc[[1,2], ['name','gender']] # first and second rows, with name and gender as columns
# frist_and_second_row_with_name_and_gender

Simple loc from here:
id               2
name      Max Ruin
class        Three
mark          85.0
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four   NaN  female
1   2  Max Ruin  Three  85.0    male
2   3    Arnold  Three  55.0    male

## Integer-Location Based Indexing

- .iloc[] is used for selecting rows adn columns by integer index postiions
- Similar to .loc[] we can use single integer, list of integers, or slices

In [ ]:
# Selecting rows based on index positions

print(students.iloc[1])
print(students.iloc[:3])

# Slicing rows

print(students.iloc[0:2,1:2]) # Rows 0 to 2, columns 1 to 2
students.iloc[[4,5],[0,4]] # Rows 4 and 5, columns 0 and 4

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male
       name
0  John Deo
1  Max Ruin

   id  gender
4   5  female
5   6    male

### Single value access (.at[] and .iat[])
- .at[] is used for accessing a single scalar value by label
- .iat[] is for accessing by index position

In [ ]:
# Using .at[] to access single value by label
print(students.at[1,'name'])    # Value in row 1, column 'name'

# Using .iat[] to access single value by position
print(students.iat[6, 1]) # Value in row 6, column 1